import React from "react";
import { makeStyles } from "@material-ui/core/styles";
import Container from "@material-ui/core/Container";
import Grid from "@material-ui/core/Grid";
import ScheduleItem from "./ScheduleItem";
import "./schedule.scss";

const useStyles = makeStyles({
  container: {
    height: "96vh",

    "@media (max-width: 768px)": {
      height: "unset",
    },
  },
  grid: {
    height: "96vh",

    "@media (max-width: 768px)": {
      height: "unset",
      margin: "unset",
    },
  },
});

const courses = [
  {
    course: {
      classPrefix: "card1",
      title: "Курс (очно)",
      name: "«Бухгалтерський облік. Оподаткування»",
      start: "Кожного місяця",
      group: "15800 грн",
      indiv: "21800 грн",
      hours: "110 ак.годин",
      discount: "Знижка від 7% до 20%",
      teacher: "Викладач: Григорєва Людмила",
      proviso0: "*Знижка 7% - за довідкою ВПО",
      proviso1: "*Знижка 10% - при оплаті повної вартості курсу одним платежем",
      proviso2: "*Знижка 20% - при реєстрації від двох осіб",
      program: "Програма навчання",
      order: "Записатись",
      courseProgram: [
        "1. Введення в спеціальність:",
        "- поняття господарчої діяльності та її облік",
        "- реєстрація юридичної особи",
        "- господарські процеси, які виникають на підприємстві та їх взаємозв'язок",

        "2. Облікова політика підприємства:",
        "- типова політика",
        "- затвердження політики підприємства",

        "3. Бухгалтерський облік:",
        "- принципи БО",
        "- предмет БО",
        "- національні та міжнародні стандарти БО",

        "4. Класифікація активів:",
        "- оборотні активи",
        "- не оборотні активи",

        "5. Класифікація зобов'язань:",
        "- поточні зобов'язання",
        "- довгострокові зобов'язання",

        "6. План рахунків бухгалтерського обліку:",
        "- балансові рахунки:",
        "  * активні",
        "  * пасивні",
        "  * активно-пасивні",
        "- поза балансові рахунки: для чого потрібні та їх облік",
        "- синтетичні та аналітичні рахунки",
        "- субрахунки, як додаткові",

        "7. Елементи бухгалтерського обліку та методи. Метод подвійного запису",

        "8. Готівка та готівкові розрахунки:",
        "- Положення про касу та касові операції",
        "- норми ведення каси",
        "- документи для касових операцій",
        "- штрафні санкції за порушення",
        "- БО готівкових розрахунків",

        "9. Розрахунки в банках:",
        "- відкриття/закриття рахунку в банку",
        "- документи для розрахунків",
        "- БО безготівкових розрахунків",

        "10. Розрахунки з підзвітними особами:",
        "- сільсько-господарча закупівля",
        "- господарчі потреби",
        "- відрядження",
        "- авансові звіти",
        "- БО розрахунків з підзвітними особами",

        "11. Розрахунки з постачальниками та підрядниками:",
        "- господарчий договір",
        "- рахунки для БО",
        "- перші поняття про ПДВ:",
        "  * податкові зобов'язання",
        "  * податковий кредит",
        "  * правило першої події",
        "  * БО ПДВ",

        "12. Запаси, як оборотні активи:",
        "- зарахування на баланс",
        "- первісна вартість в залежності від способу появи запасів на підприємстві",
        "- вартість вибуття",
        "- методи вибуття",
        "- БО запасів",

        "13. Кредити:",
        "- поточні",
        "- довгострокові",
        "- види кредитів",
        "- облік кредитів",

        "14. Виплати найманим працівникам:",
        "- строки нарахування та виплати зарплати",
        "- законодавча база",
        "- документи для нарахування зарплати",
        "- нарахування зарплати:",
        "  * за фактично відпрацьований час:",
        "    √ оплата почасова",
        "    √ оплата відрядна",
        "    √ оклад/тарифна ставка",
        "    √ поняття мінімальної зарплати",
        "  * оплата в період відрядження",
        "  * відпускні",
        "  * лікарняні",
        "  * премії",
        "  * інші нарахування",
        "- утримання з зарплати:",
        "  * ПДФО",
        "  * військовий збір",
        "  * аліменти та інші утримання по виконавчим листам",
        "- нарахування та сплата ЄСВ",
        "- матеріальна допомога:",
        "  * з податками",
        "  * неоподатковувана",
        "  * додаткове благо",
        "- зарплата не грошима",
        "- БО виплат робітникам",
        "- звітність по зарплаті",

        "15. Необоротні активи:",
        "- види вартості:",
        "  * первісна",
        "  * ліквідаційна",
        "  * амортизаційна",
        "  * залишкова",
        "- основні засоби",
        "- нематеріальні активи",
        "- інші матеріальні необоротні активи",
        "- амортизація і методи нарахування",
        "- період корисного використання",
        "- знос та ліквідація необоротних активів",
        "- БО необоротних активів",

        "16. Інвентаризація:",
        "- необхідна по законодавству",
        "- за рішенням підприємства",
        "- залишки та нестачі і їх БО",
        "- документування інвентаризації",

        "17. Розрахунки з дебіторами:",
        "- поточна заборгованість",
        "- довгострокова заборгованість",
        "- сумнівні та безнадійні борги і їх облік",
        "- документування розрахунків з дебіторами",
        "- БО розрахунків",

        "18. Вексельна форма розрахунків:",
        "- поняття розрахунків з векселями",
        "- простий вексель",
        "- переведений вексель",
        "- БО векселів",

        "19. Визнання доходів та витрат і їх облік",

        "20. Фінансові результати діяльності:",
        "- збитки",
        "- прибутки і направлення їх використання",
        "- дивіденди та їх розподіл",
        "- фінансова звітність:",
        "  * визначення звітів для статистики та податкової",
        "  * баланс",
        "  * звіт про фінрезультати",
        "  * заповнення звітності та строки подання",

        "21. Податковий облік:",
        "- системи оподаткування в Україні",
        "- загальнодержавні та місцеві податки",
        "- податок на прибуток",
        "- ПДВ",
      ],
      makeStyles: {
        toolbar1: {
            backgroundColor: "#fff8e7", // ванільний
            color: "#3e2c23", // насичена кава
        },
        toolbar2: {
          backgroundColor: "#fffefa", // майже білий з теплим відтінком
          color: "#5c4033",
          height: "150px",
          marginBottom: "7px",
        },
        button1: {
          width: "100%",
          backgroundColor: "#d6a87a", // пісочний/карамельний
          color: "white",
          "&:hover": { backgroundColor: "#b97c50" }, // трохи темніший
        },
        button2: {
          width: "100%",
          backgroundColor: "#fae8d1", // кремовий
          color: "#5c4033",
          height: "45px",
          "&:hover": { backgroundColor: "#f1d8be" },
        },
        typography: {
          fontSize: "17px",
          fontWeight: 600,
          color: "#3f2e1f", // темний елегантний текст
        },
        discountText: {
          color: "#8b5e3c", // колір "кави з молоком"
          fontWeight: 500,
        },
        proviso: {
          fontSize: "14px",
          color: "#9e9483", // м’який сіробежевий
        },
      },
    },
  },
  {
    course: {
      classPrefix: "card2",
      title: "Курс (очно)",
      name: "«Спеціаліст відділу кадрів»",
      start: "Кожного місяця",
      group: "7920 грн",
      indiv: "12770 грн",
      hours: "50 ак.годин",
      discount: "Знижка від 7% до 20%",
      teacher: "Викладач: Григорєва Людмила",
      proviso0: "*Знижка 7% - за довідкою ВПО",
      proviso1: "*Знижка 10% - при оплаті повної вартості курсу одним платежем",
      proviso2: "*Знижка 20% - при реєстрації від двох осіб",
      program: "Програма навчання",
      order: "Записатись",
      courseProgram: [
        "1. Робочий час:",
        "- повний робочий час",
        "- неповний робочий час",
        "- скорочений робочий час",

        "2. Види трудових договорів",

        "3. Нетрудові договори",

        "4. Час відпочинку",

        "5. Випробувальний термін",

        "6. Штатний розпис",

        "7. Практика та стажування",

        "8. Правила внутрішнього трудового розпорядку",

        "9. Табель обліку робочого часу",

        "10. Особова картка форми П-2",

        "11. Особова справа",

        "12. Оформлення прийому на роботу",

        "13. Дистанційна робота",

        "14. Фрілансер",

        "15. Порядок працевлаштування іноземців",

        "16. Норматив робочих місць для осіб з інвалідністю",

        "17. Відшкодування роботодавцю за облаштування робочого місця для особи з інвалідністю",

        "18. Атестація робочих місць",

        "19. Посадова інструкція",

        "20. Комісія з соціального страхування",

        "21. Оплата праці",

        "22. Державний класифікатор професій",

        "23. Тарифно-кваліфікаційний довідник",

        "24. Сумісництво та суміщення",

        "25. Відпустки",

        "26. Призупинення діяльності",

        "27. Звільнення",

        "28. Трудова книжка",

        "29. Нове робоче місце",

        "30. Ведення військового обліку",

        "31. Перевірки Держпраці",
      ],
      makeStyles: {
        toolbar1: {
            backgroundColor: "#fff8e7", // ванільний
            color: "#3e2c23", // насичена кава
        },
        toolbar2: {
          backgroundColor: "#fffefa", // майже білий з теплим відтінком
          color: "#5c4033",
          height: "150px",
          marginBottom: "7px",
        },
        button1: {
          width: "100%",
          backgroundColor: "#d6a87a", // пісочний/карамельний
          color: "white",
          "&:hover": { backgroundColor: "#b97c50" }, // трохи темніший
        },
        button2: {
          width: "100%",
          backgroundColor: "#fae8d1", // кремовий
          color: "#5c4033",
          height: "45px",
          "&:hover": { backgroundColor: "#f1d8be" },
        },
        typography: {
          fontSize: "17px",
          fontWeight: 600,
          color: "#3f2e1f", // темний елегантний текст
        },
        discountText: {
          color: "#8b5e3c", // колір "кави з молоком"
          fontWeight: 500,
        },
        proviso: {
          fontSize: "14px",
          color: "#9e9483", // м’який сіробежевий
        },
      },
    },
  },
  {
    course: {
      classPrefix: "card3",
      title: "Курс (очно)",
      name: "«Академія підприємця (ФОП)»",
      start: "Кожного місяця",
      group: "5170 грн",
      indiv: "7590 грн",
      hours: "30 ак.годин",
      discount: "Знижка від 7% до 20%",
      teacher: "Викладач: Григорєва Людмила",
      proviso0: "*Знижка 7% - за довідкою ВПО",
      proviso1: "*Знижка 10% - при оплаті повної вартості курсу одним платежем",
      proviso2: "*Знижка 20% - при реєстрації від двох осіб",
      program: "Програма навчання",
      order: "Записатись",
      courseProgram: [
        "1. Реєстрація / зняття з реєстрації ФОП",

        "2. Системи оподаткування",

        "3. Постановка на облік в податковій",

        "4. Документи, потрібні для обліку",

        "5. Відкриття рахунків у банках",

        "6. Відпустка та лікарняний у ФОП",

        "7. Оренда, надана / отримана ФОП",

        "8. Поворотна фінансова допомога, отримана ФОП або надана від ФОП",

        "9. Податок на майно та землю у ФОП",

        "10. Незалежні професіонали:",
        "- реєстрація",
        "- система оподаткування",
        "- нарахування та сплата податків, зборів і внесків",
        "- строки сплати",
        "- облік доходів та витрат",
        "- звітність",
        "- наймані працівники",

        "11. Загальна система оподаткування:",
        "- постановка на облік",
        "- облік доходів та витрат",
        "- нарахування та сплата ПДФО, ЄСВ, військового збору",
        "- отримання ліцензій",
        "- роздрібний акциз",
        "- ПДВ",
        "- звітність",
        "- наймані працівники",

        "12. Спрощена система оподаткування:",
        "- групи платників єдиного податку",
        "- ліміти річного доходу",
        "- кількість дозволених найманих працівників",
        "- дозволені види діяльності",
        "- нарахування та сплата єдиного податку",
        "- звітність",
        "- ПДВ",
        "- отримання ліцензії",

        "13. Єдиний соціальний внесок (ЄСВ) для ФОП:",
        "- платники ЄСВ",
        "- категорії, звільнені від сплати",
        "- мінімальний розмір внеску",
        "- строки сплати",
        "- подання звітності",
      ],
      makeStyles: {
        toolbar1: {
            backgroundColor: "#fff8e7", // ванільний
            color: "#3e2c23", // насичена кава
        },
        toolbar2: {
          backgroundColor: "#fffefa", // майже білий з теплим відтінком
          color: "#5c4033",
          height: "150px",
          marginBottom: "7px",
        },
        button1: {
          width: "100%",
          backgroundColor: "#d6a87a", // пісочний/карамельний
          color: "white",
          "&:hover": { backgroundColor: "#b97c50" }, // трохи темніший
        },
        button2: {
          width: "100%",
          backgroundColor: "#fae8d1", // кремовий
          color: "#5c4033",
          height: "45px",
          "&:hover": { backgroundColor: "#f1d8be" },
        },
        typography: {
          fontSize: "17px",
          fontWeight: 600,
          color: "#3f2e1f", // темний елегантний текст
        },
        discountText: {
          color: "#8b5e3c", // колір "кави з молоком"
          fontWeight: 500,
        },
        proviso: {
          fontSize: "14px",
          color: "#9e9483", // м’який сіробежевий
        },
      },
    },
  },
  {
    course: {
      classPrefix: "card4",
      title: "Курс (очно/онлайн)",
      name: "«Сучасна автотранспортна логістика»",
      start: "Кожного місяця",
      group: "6820 грн",
      indiv: "9940 грн",
      hours: "30 ак.годин",
      discount: "Знижка від 7% до 20%",
      teacher: "Викладач: Карпенко Альбіна",
      proviso0: "Знижка 7% - за довідкою ВПО",
      proviso1: "Знижка 10% - при оплаті повної вартості курсу одним платежем",
      proviso2: "*Знижка 20% - при реєстрації від двох осіб",
      program: "Програма навчання",
      order: "Записатись",
      courseProgram: [
        "1. Автовантажні перевезення та їх роль в економіці країни",

        "2. Поняття про логістику. Історія логістики",

        "3. Призначення та функції логіста, диспетчера, експедитора",

        "4. Участь і функції логіста в автотранспортних перевезеннях",

        "5. Характеристика автотранспорту. Критерії вибору необхідного типу автомобіля з урахуванням виду вантажу",

        "6. Вантаж. Вантажообробка",

        "7. Розміщення вантажу у транспортному засобі відповідно до його властивостей:",
        "- вантажі, що швидко псуються",
        "- важкі та негабаритні вантажі",
        "- штучні вантажі",
        "- насипні вантажі",
        "- навалювальні вантажі",

        "8. Участь логіста в підготовці вантажу для перевезення",

        "9. Необхідна документація:",
        "- заявка на перевезення",
        "- транспортне замовлення",
        "- договір перевезення",
        "- договір транспортного експедирування",
        "- супровідні документи для перевезення вантажу",

        "10. Розробка схеми оптимального маршруту перевезення",

        "11. Відповідальність логіста під час доставки вантажу",

        "12. Ціноутворення вантажного перевезення",

        "13. Можливі ризики при перевезенні вантажів та їх мінімізація",

        "14. Міжнародні перевезення та участь логіста в них",

        "15. Аналіз інформаційно-транспортних порталів та сайтів",

        "16. Пошук нових клієнтів та навички ведення діалогу з ними",

        "17. Законодавча база стосовно роботи логіста",

        "18. Поточні тестування, завдання, шаблони документів",
      ],
      makeStyles: {
        toolbar1: {
            backgroundColor: "#fff8e7", // ванільний
            color: "#3e2c23", // насичена кава
        },
        toolbar2: {
          backgroundColor: "#fffefa", // майже білий з теплим відтінком
          color: "#5c4033",
          height: "150px",
          marginBottom: "7px",
        },
        button1: {
          width: "100%",
          backgroundColor: "#d6a87a", // пісочний/карамельний
          color: "white",
          "&:hover": { backgroundColor: "#b97c50" }, // трохи темніший
        },
        button2: {
          width: "100%",
          backgroundColor: "#fae8d1", // кремовий
          color: "#5c4033",
          height: "45px",
          "&:hover": { backgroundColor: "#f1d8be" },
        },
        typography: {
          fontSize: "17px",
          fontWeight: 600,
          color: "#3f2e1f", // темний елегантний текст
        },
        discountText: {
          color: "#8b5e3c", // колір "кави з молоком"
          fontWeight: 500,
        },
        proviso: {
          fontSize: "14px",
          color: "#9e9483", // м’який сіробежевий
        },
      },
    },
  },
  {
    course: {
      classPrefix: "card5",
      title: "Курс (очно)",
      name: "«Академія ФОП (без найманих осіб)»",
      start: "Уточнюйте дату старту",
      group: "4200 грн",
      indiv: "6100 грн",
      hours: "20 ак. годин",
      discount: "Знижка від 7% до 20%",
      teacher: "Викладач: Григорєва Людмила",
      proviso0: "*Знижка 7% - за довідкою ВПО",
      proviso1: "*Знижка 10% - при оплаті повної вартості курсу одним платежем",
      proviso2: "*Знижка 20% - при реєстрації від двох осіб",
      program: "Програма навчання",
      order: "Записатись",
      courseProgram: [
        "1) Реєстрація ФОП / припинення реєстрації",
        "2) Постановка на облік у податковому органі",
        "3) Ведення обліку доходів / витрат",
        "4) Оформлення змін реєстраційних даних",
        "5) Реєстрація місця отримання доходів (форма 20-ОПП)",
        "6) Незалежна професійна діяльність",
        "7) Загальна система оподаткування",
        "8) Спрощена система оподаткування (докладно кожна група)",
      ],
      makeStyles: {
        toolbar1: {
            backgroundColor: "#fff8e7", // ванільний
            color: "#3e2c23", // насичена кава
        },
        toolbar2: {
          backgroundColor: "#fffefa", // майже білий з теплим відтінком
          color: "#5c4033",
          height: "150px",
          marginBottom: "7px",
        },
        button1: {
          width: "100%",
          backgroundColor: "#d6a87a", // пісочний/карамельний
          color: "white",
          "&:hover": { backgroundColor: "#b97c50" }, // трохи темніший
        },
        button2: {
          width: "100%",
          backgroundColor: "#fae8d1", // кремовий
          color: "#5c4033",
          height: "45px",
          "&:hover": { backgroundColor: "#f1d8be" },
        },
        typography: {
          fontSize: "17px",
          fontWeight: 600,
          color: "#3f2e1f", // темний елегантний текст
        },
        discountText: {
          color: "#8b5e3c", // колір "кави з молоком"
          fontWeight: 500,
        },
        proviso: {
          fontSize: "14px",
          color: "#9e9483", // м’який сіробежевий
        },
      },
    },
  },
  {
    course: {
      classPrefix: "card6",
      title: "Курс (очно)",
      name: "«Aсистент/помічник керівника. Модуль 1»",
      start: "Уточнюйте дату старту",
      group: "5100 грн",
      indiv: "7800 грн",
      hours: "30 ак. годин",
      discount: "Знижка від 7% до 20%",
      teacher: "Викладач: Григорєва Людмила",
      proviso0: "*Знижка 7% - за довідкою ВПО",
      proviso1: "*Знижка 10% - при оплаті повної вартості курсу одним платежем",
      proviso2: "*Знижка 20% - при реєстрації від двох осіб",
      program: "Програма навчання",
      order: "Записатись",
      courseProgram: [
        "1. Діловий етикет та етика",
        "2. Обов'язки помічника/асистента керівника, секретаря, офіс-менеджера, референта, адміністратора",
        "3. Правильний початок своєї роботи — запорука подальшого успіху",
        "4. Планування робочого дня, в т.ч. керівника",
        "5. Телефонні переговори",
        "6. Прийом клієнтів",
        "7. Все про діловодство",
        "8. Номенклатура справ. Норми і правила",
        "9. Кадрове діловодство",
      ],
      makeStyles: {
        toolbar1: {
            backgroundColor: "#fff8e7", // ванільний
            color: "#3e2c23", // насичена кава
        },
        toolbar2: {
          backgroundColor: "#fffefa", // майже білий з теплим відтінком
          color: "#5c4033",
          height: "150px",
          marginBottom: "7px",
        },
        button1: {
          width: "100%",
          backgroundColor: "#d6a87a", // пісочний/карамельний
          color: "white",
          "&:hover": { backgroundColor: "#b97c50" }, // трохи темніший
        },
        button2: {
          width: "100%",
          backgroundColor: "#fae8d1", // кремовий
          color: "#5c4033",
          height: "45px",
          "&:hover": { backgroundColor: "#f1d8be" },
        },
        typography: {
          fontSize: "17px",
          fontWeight: 600,
          color: "#3f2e1f", // темний елегантний текст
        },
        discountText: {
          color: "#8b5e3c", // колір "кави з молоком"
          fontWeight: 500,
        },
        proviso: {
          fontSize: "14px",
          color: "#9e9483", // м’який сіробежевий
        },
      },
    },
  },
  {
    course: {
      classPrefix: "card7",
      title: "Курс (очно)",
      name: "«SMART асистент/помічник керівника. Модуль 2»",
      start: "Уточнюйте дату старту",
      group: "3100 грн",
      indiv: "4800 грн",
      hours: "16 ак. годин",
      discount: "Знижка від 7% до 20%",
      teacher: "Викладач: Григорєва Людмила",
      proviso0: "*Знижка 7% - за довідкою ВПО",
      proviso1: "*Знижка 10% - при оплаті повної вартості курсу одним платежем",
      proviso2: "*Знижка 20% - при реєстрації від двох осіб",
      program: "Програма навчання",
      order: "Записатись",
      courseProgram: [
        "1. Загальні поняття. Особливості використання програм у роботі",
        "2. Робота з гугл-інструментами: Google Docs, календар, презентації",
        "3. Kanban-дошка як один з методів управління проєктами",
        "4. Ознайомлення з Trello — візуальний інструмент для керування проєктами, процесами та виконанням завдань",
        "5. Програми для створення резюме. Як зробити резюме ефективним та сучасним",
        "6. Miro — платформа для спільної роботи розподілених команд",
        "7. Редактор Tome — сервіс для створення презентацій за допомогою нейромережі",
        "8. Програми для тайм-менеджменту: планувальники задач, тайм-тренери, розподіл завдань та інше",
      ],
      makeStyles: {
        toolbar1: {
            backgroundColor: "#fff8e7", // ванільний
            color: "#3e2c23", // насичена кава
        },
        toolbar2: {
          backgroundColor: "#fffefa", // майже білий з теплим відтінком
          color: "#5c4033",
          height: "150px",
          marginBottom: "7px",
        },
        button1: {
          width: "100%",
          backgroundColor: "#d6a87a", // пісочний/карамельний
          color: "white",
          "&:hover": { backgroundColor: "#b97c50" }, // трохи темніший
        },
        button2: {
          width: "100%",
          backgroundColor: "#fae8d1", // кремовий
          color: "#5c4033",
          height: "45px",
          "&:hover": { backgroundColor: "#f1d8be" },
        },
        typography: {
          fontSize: "17px",
          fontWeight: 600,
          color: "#3f2e1f", // темний елегантний текст
        },
        discountText: {
          color: "#8b5e3c", // колір "кави з молоком"
          fontWeight: 500,
        },
        proviso: {
          fontSize: "14px",
          color: "#9e9483", // м’який сіробежевий
        },
      },
    },
  },
  {
    course: {
      classPrefix: "card8",
      title: "Курс (очно)",
      name: "«Управління персоналом»",
      start: "Уточнюйте дату старту",
      group: "8600 грн",
      indiv: "15900 грн",
      hours: "50 ак. годин",
      discount: "Знижка від 7% до 20%",
      teacher: "Викладач: Григорєва Людмила",
      proviso0: "*Знижка 7% - за довідкою ВПО",
      proviso1: "*Знижка 10% - при оплаті повної вартості курсу одним платежем",
      proviso2: "*Знижка 20% - при реєстрації від двох осіб",
      program: "Програма навчання",
      order: "Записатись",
      courseProgram: [
        "Блок 1. Системи управління:",
        "1) Типи систем",
        "2) Переваги та недоліки",
        "3) Практичні рекомендації",

        "Блок 2. Керуючий (менеджер) персоналом:",
        "1) Функції у зв’язку з етапами роботи компанії",
        "2) Мета управління",
        "3) Способи управління",
        "4) Кадрова політика",

        "Блок 3. Підбір персоналу:",
        "1) Визначення вимог до кандидатів",
        "2) Методи підбору",
        "3) Співбесіда та аналіз результатів",

        "Блок 4. Адаптація:",
        "1) Трудова адаптація",
        "2) Соціальна адаптація",
        "3) Куратор",
        "4) Документування результатів",

        "Блок 5. Кар’єра:",
        "1) Види кар’єри",
        "2) План кар’єрного зростання",
        "3) Етапи кар’єри",
        "4) Аналіз результатів",

        "Блок 6. Підвищення кваліфікації та навчання персоналу:",
        "1) Визначення необхідності підвищення чи навчання",
        "2) Цілі навчання: навіщо, для чого, що хочемо отримати у результаті",
        "3) Форми навчання або підвищення кваліфікації",
        "4) Визначення ефекту проведених заходів",
        "5) Підрахунок ККД",

        "Блок 7. Оцінка персоналу:",
        "1) Способи та методи оцінки",
        "2) Аналіз зайнятості",
        '3) Визначення "незавантажених" або "зайвих" працівників',
        "4) Забезпечення зайнятості персоналу",

        "Блок 8. Мотивація:",
        "1) Аналіз анкет, заповнених при прийомі на роботу",
        "2) Мотивація для персоналу конкретного підприємства",
        "3) Види мотивації",
        "4) Необхідність мотивації",

        "Блок 9. Корпоративна культура:",
        "1) Стихійно сформована культура",
        "2) Визначення основних напрямів розвитку корпоративної культури",
        "3) План формування корпоративної культури",
        "4) Розробка положення про корпоративну культуру",
        "5) Вигоди планової корпоративної культури",
      ],
      makeStyles: {
        toolbar1: {
            backgroundColor: "#fff8e7", // ванільний
            color: "#3e2c23", // насичена кава
        },
        toolbar2: {
          backgroundColor: "#fffefa", // майже білий з теплим відтінком
          color: "#5c4033",
          height: "150px",
          marginBottom: "7px",
        },
        button1: {
          width: "100%",
          backgroundColor: "#d6a87a", // пісочний/карамельний
          color: "white",
          "&:hover": { backgroundColor: "#b97c50" }, // трохи темніший
        },
        button2: {
          width: "100%",
          backgroundColor: "#fae8d1", // кремовий
          color: "#5c4033",
          height: "45px",
          "&:hover": { backgroundColor: "#f1d8be" },
        },
        typography: {
          fontSize: "17px",
          fontWeight: 600,
          color: "#3f2e1f", // темний елегантний текст
        },
        discountText: {
          color: "#8b5e3c", // колір "кави з молоком"
          fontWeight: 500,
        },
        proviso: {
          fontSize: "14px",
          color: "#9e9483", // м’який сіробежевий
        },
      },
    },
  },
  {
    course: {
      classPrefix: "card9",
      title: "Курс (очно)",
      name: "«Ландшафтний дизайн (4 окремих модулі)»",
      start: "Листопад 2025",
      group: "Вказана у програмі курсу",
      indiv: "Вказана у програмі курсу",
      hours: "У програмі навчання",
      discount: "Знижка від 7% до 20%",
      teacher: "Викладач: Григорєва Людмила",
      proviso0: "*Знижка 7% - за довідкою ВПО",
      proviso1: "*Знижка 10% - при оплаті повної вартості курсу одним платежем",
      proviso2: "*Знижка 20% - при реєстрації від двох осіб",
      program: "Програма навчання",
      order: "Записатись",
      courseProgram: [
        "МОДУЛЬ 1. | АРХІТЕКТУРА В ЛАНДШАФТНОМУ ДИЗАЙНІ | Тривалість 68 ак.годин | Вартість 8840 грн",
        '1. Мистецтво ландшафтного дизайна. Професія "Ландшафтний дизайнер".',
        "2. Історія розвитку садово-паркового мистецтва. Основні типи парків. Сади і парки світу.",
        "3. Сучасні сади:",
        '– "сільський" сад',
        '– стиль "кантрі"',
        '– сад у стилі "модерн"',
        "– архітектурний сад",
        "– еклектика у створенні саду",
        "4. Основи проєктування:",
        "– виконання опорного плану ділянки",
        "– передпроєктні польоти",
        "– виділення зон ділянки",
        "– робоче креслення для дизайна",
        "– генеральний план",
        "– ескізний проєкт",
        "– дендрологічний план ділянки",
        "– деталізація окремих планів",
        "– приклади проєктів",
        "– малювання ескізів",
        "5. Садовий дизайн:",
        "– концепція та композиція ділянки",
        "– простір",
        "– перспектива",
        "– колористика",
        "– колір та поєднання кольорів",
        "– симетрія та асиметрія на ділянці",
        "– повтори",
        "– поєднання",
        "6. Планування рельєфу. Геопластика.",
        "7. Елементи бруківки, сходи, доріжки, майданчики, патіо.",
        "8. Огорожі / паркани на ділянці.",
        "9. Основи матеріалознавства. Натуральне та штучне каміння.",
        "10. Освітлення в саду. Декоративна підсвітка.",
        "11. Вертикальне планування. Відведення води в саду. Дренаж.",
        "12. Архітектурні елементи саду:",
        "– водойми",
        "– ставки",
        "– струмки",
        "– басейни",
        "– водоспади",
        "– кам'яністі сади",

        "МОДУЛЬ 2 | ОСНОВИ ГРУНТОЗНАВСТВА | Тривалість 10 ак.годин | Вартість 1500 грн ",
        "1. Грунти України.",
        "2. Фактори ґрунтоутворення. Типи грунтів.",
        "3. Окультурювання різних типів грунтів.",
        "4. Компост.",
        "5. Сидерати.",
        "6. Аналіз грунту ділянки. Механічний склад грунту.",

        "МОДУЛЬ 3 | ДЕКОРАТИВНА ДЕНДРОЛОГІЯ. РОСЛИНИ У ЛАНДШАФТІ | Тривалість 48 ак.годин | Вартість 6240 грн",
        "1. Декоративна дендрологія. Фізіологія і екологія рослин.",
        "2. Рослинні елементи саду:",
        "– живі огорожі",
        "– поодинокі посадки",
        "– посадки рослин групами",
        "3. Сад безперервного цвітіння.",
        "4. Квітники. Їх види та форми.",
        "5. Альпінарії та рокарії.",
        "6. Водойми.",
        "7. Контейнерні сади.",
        "8. Рослини для вертикального озеленення. Арки. Перголи. Навіси. Декоративні грати.",
        "9. Декоративний город. Рослини-компаньйони та антагоністи.",
        "10. Газони. Їх види та устрій.",
        "11. Захист дипломних проєктів:",
        "– генплан ділянки",
        "– ескізний проєкт",
        "– вертикальний розріз",
        "– опис проєкту",
        "– детальний проєкт окремої зони",

        "МОДУЛЬ 4 | ДОГЛЯД ЗА САДОМ. ВИРОЩУВАННЯ РОСЛИН НА ДІЛЯНЦІ | Тривалість 36 ак.годин | Вартість 4680 грн",
        "1. Рослини для малодоглядного саду. Як зробити догляд за садом простим.",
        "2. Голонасінні рослини. Їх підбір. Агрономія.",
        "3. Декоративні дерева та чагарники. Їх підбір. Агрономія.",
        "4. Плодово-ягідні дерева та чагарники. Їх догляд. Агрономія.",
        "5. Рослини для декоративного городу. Їх догляд. Агрономія.",
        "6. Однорічні, дворічні та багаторічні трав’янисті рослини. Їх догляд. Агрономія.",
        "7. Цибулинні рослини. Їх догляд. Агрономія.",
        "8. Ліани на ділянці. Їх догляд. Агрономія.",
        "9. Газон на ділянці та догляд за ним.",
        "10. Сезонні роботи в саду.",
      ],
      makeStyles: {
        toolbar1: {
            backgroundColor: "#fff8e7", // ванільний
            color: "#3e2c23", // насичена кава
        },
        toolbar2: {
          backgroundColor: "#fffefa", // майже білий з теплим відтінком
          color: "#5c4033",
          height: "150px",
          marginBottom: "7px",
        },
        button1: {
          width: "100%",
          backgroundColor: "#d6a87a", // пісочний/карамельний
          color: "white",
          "&:hover": { backgroundColor: "#b97c50" }, // трохи темніший
        },
        button2: {
          width: "100%",
          backgroundColor: "#fae8d1", // кремовий
          color: "#5c4033",
          height: "45px",
          "&:hover": { backgroundColor: "#f1d8be" },
        },
        typography: {
          fontSize: "17px",
          fontWeight: 600,
          color: "#3f2e1f", // темний елегантний текст
        },
        discountText: {
          color: "#8b5e3c", // колір "кави з молоком"
          fontWeight: 500,
        },
        proviso: {
          fontSize: "14px",
          color: "#9e9483", // м’який сіробежевий
        },
      },
    },
  },
  {
    course: {
      classPrefix: "card10",
      title: "Курс (очно)",
      name: "«Скетчинг»",
      start: "Уточнюйте дату старту",
      group: "10200 грн",
      indiv: "14300 грн",
      hours: "38 ак. годин",
      discount: "Знижка від 7% до 20%",
      teacher: "Викладач: Григорєва Людмила",
      proviso0: "*Знижка 7% - за довідкою ВПО",
      proviso1: "*Знижка 10% - при оплаті повної вартості курсу одним платежем",
      proviso2: "*Знижка 20% - при реєстрації від двох осіб",
      program: "Програма навчання",
      order: "Записатись",
      courseProgram: [
        "1) Матеріали та техніки",
        "2) Пляма, крапка, штрих. Текстури",
        "3) Композиція і компоновка",
        "4) Світлотінь та об'єм. Передача об'єму за допомогою світла і тіні",
        "5) Поняття:",
        "- лінійна перспектива",
        "- повітряна перспектива",
        "6) Види відображень об'єктів для подання уявлення",
        "7) Планування. Генплан",
        "8) Об'ємно-просторовий ескіз",
      ],
      makeStyles: {
        toolbar1: {
            backgroundColor: "#fff8e7", // ванільний
            color: "#3e2c23", // насичена кава
        },
        toolbar2: {
          backgroundColor: "#fffefa", // майже білий з теплим відтінком
          color: "#5c4033",
          height: "150px",
          marginBottom: "7px",
        },
        button1: {
          width: "100%",
          backgroundColor: "#d6a87a", // пісочний/карамельний
          color: "white",
          "&:hover": { backgroundColor: "#b97c50" }, // трохи темніший
        },
        button2: {
          width: "100%",
          backgroundColor: "#fae8d1", // кремовий
          color: "#5c4033",
          height: "45px",
          "&:hover": { backgroundColor: "#f1d8be" },
        },
        typography: {
          fontSize: "17px",
          fontWeight: 600,
          color: "#3f2e1f", // темний елегантний текст
        },
        discountText: {
          color: "#8b5e3c", // колір "кави з молоком"
          fontWeight: 500,
        },
        proviso: {
          fontSize: "14px",
          color: "#9e9483", // м’який сіробежевий
        },
      },
    },
  },
  {
    course: {
      classPrefix: "card11",
      title: "Курс (очно)",
      name: "«Excel: з нуля до профі (2 модулі)»",
      start: "Уточнюйте дату старту",
      group: "4900 грн",
      indiv: "7100 грн",
      hours: "40 ак. годин",
      discount: "Знижка від 7% до 20%",
      teacher: "Викладач: Григорєва Людмила",
      proviso0: "*Знижка 7% - за довідкою ВПО",
      proviso1: "*Знижка 10% - при оплаті повної вартості курсу одним платежем",
      proviso2: "*Знижка 20% - при реєстрації від двох осіб",
      program: "Програма навчання",
      order: "Записатись",
      courseProgram: [
        "МОДУЛЬ 1",

        "1. Знайомство з інтерфейсом Excel",
        "• Основні елементи інтерфейсу програми",
        "• Робоча область: як змінювати розмір комірок",
        "• Робота з аркушами: створення, перейменування, переміщення",
        "• Введення та форматування даних у комірках",
        "• Використання автоматичного заповнення комірок",
        "• Практичне заняття: робота з інтерфейсом та введенням даних",

        "2. Форматування комірок",
        "• Типи даних у Excel: числовий, текстовий, дата, валюта тощо",
        "• Зміна формату даних для зручного відображення",
        "• Додавання та редагування меж комірок",
        "• Налаштування кольору, шрифту та вирівнювання тексту",
        "• Практичне заняття: форматування таблиці з різними типами даних",

        "3. Використання формул у Excel",
        "• Створення простих формул (додавання, віднімання, множення, ділення)",
        "• Використання постійних значень у формулах",
        "• Робота з діапазонами даних у формулах",
        "• Практичне заняття: складання формул для підрахунків у таблиці",

        "4. Робота з даними: сортування, фільтри, діаграми",
        "• Сортування даних за зростанням та спаданням",
        "• Використання фільтрів для вибірки необхідної інформації",
        "• Створення та налаштування діаграм (графіків)",
        "• Практичне заняття: аналіз даних за допомогою сортування, фільтрів та діаграм",

        "5. Створення таблиць та робота з файлами",
        "• Як створювати та налаштовувати таблиці",
        "• Збереження файлів у різних форматах (Excel, PDF, CSV тощо)",
        "• Способи експорту даних та взаємодія Excel з іншими програмами",
        "• Практичне заняття: збереження та обмін файлами",

        "6. Зведені таблиці (Pivot Tables)",
        "• Що таке зведені таблиці та для чого вони потрібні",
        "• Створення та налаштування зведених таблиць",
        "• Аналіз та групування даних у зведених таблицях",
        "• Практичне заняття: створення зведеної таблиці для аналізу даних",

        "МОДУЛЬ 2",

        "1. Логічні розрахунки – функції ЯКЩО, ТА, АБО. Створення умовних обчислень для автоматизації задач.",
        "2. Розрахунки з посиланнями та масивами – функції ВПР, ГПР, ІНДЕКС, ПОШУКПОЗ. Побудова взаємозв’язків між таблицями.",
        "3. Текстові операції – об’єднання, очищення, редагування текстових даних за допомогою формул.",
        "4. Макроси – автоматизація повторюваних дій у Excel. Основи запису макросів.",
        "5. Запити – обробка великих обсягів даних за допомогою Power Query. Фільтрація, об’єднання, трансформація.",
        "6. Перехід у Power BI – створення інтерактивних звітів і дашбордів на базі Excel-даних.",

        "Кожна тема супроводжується практичними завданнями.",
      ],
      makeStyles: {
        toolbar1: {
            backgroundColor: "#fff8e7", // ванільний
            color: "#3e2c23", // насичена кава
        },
        toolbar2: {
          backgroundColor: "#fffefa", // майже білий з теплим відтінком
          color: "#5c4033",
          height: "150px",
          marginBottom: "7px",
        },
        button1: {
          width: "100%",
          backgroundColor: "#d6a87a", // пісочний/карамельний
          color: "white",
          "&:hover": { backgroundColor: "#b97c50" }, // трохи темніший
        },
        button2: {
          width: "100%",
          backgroundColor: "#fae8d1", // кремовий
          color: "#5c4033",
          height: "45px",
          "&:hover": { backgroundColor: "#f1d8be" },
        },
        typography: {
          fontSize: "17px",
          fontWeight: 600,
          color: "#3f2e1f", // темний елегантний текст
        },
        discountText: {
          color: "#8b5e3c", // колір "кави з молоком"
          fontWeight: 500,
        },
        proviso: {
          fontSize: "14px",
          color: "#9e9483", // м’який сіробежевий
        },
      },
    },
  },
  {
    course: {
      classPrefix: "card12",
      title: "Курс (очно)",
      name: "«BAS Бухгалтерія Профі»",
      start: "Уточнюйте дату старту",
      group: "5610 грн",
      indiv: "7910 грн",
      hours: "20 ак. годин",
      discount: "Знижка від 7% до 20%",
      teacher: "Викладач: Лоік Інна Володимирівна",
      proviso0: "*Знижка 7% - за довідкою ВПО",
      proviso1: "*Знижка 10% - при оплаті повної вартості курсу одним платежем",
      proviso2: "*Знижка 20% - при реєстрації від двох осіб",
      program: "Програма навчання",
      order: "Записатись",
      courseProgram: [],
      makeStyles: {
        toolbar1: {
            backgroundColor: "#fff8e7", // ванільний
            color: "#3e2c23", // насичена кава
        },
        toolbar2: {
          backgroundColor: "#fffefa", // майже білий з теплим відтінком
          color: "#5c4033",
          height: "150px",
          marginBottom: "7px",
        },
        button1: {
          width: "100%",
          backgroundColor: "#d6a87a", // пісочний/карамельний
          color: "white",
          "&:hover": { backgroundColor: "#b97c50" }, // трохи темніший
        },
        button2: {
          width: "100%",
          backgroundColor: "#fae8d1", // кремовий
          color: "#5c4033",
          height: "45px",
          "&:hover": { backgroundColor: "#f1d8be" },
        },
        typography: {
          fontSize: "17px",
          fontWeight: 600,
          color: "#3f2e1f", // темний елегантний текст
        },
        discountText: {
          color: "#8b5e3c", // колір "кави з молоком"
          fontWeight: 500,
        },
        proviso: {
          fontSize: "14px",
          color: "#9e9483", // м’який сіробежевий
        },
      },
    },
  },
  {
    course: {
      classPrefix: "card13",
      title: "Курс (очно)",
      name: "«BAS бухгалтерія CORP",
      start: "Уточнюйте дату старту",
      group: "8140 грн",
      indiv: "9800 грн",
      hours: "20 ак. годин",
      discount: "Знижка 7%",
      teacher: "Викладач: Лоік Інна Володимирівна",
      proviso3: "*Знижка 7% - за довідкою ВПО",
      program: "Програма навчання",
      order: "Записатись",
      courseProgram: [
        "Блок 1. Налаштування обліку та початкові залишки",
        "Блок 2. Каса, авансові звіти та інші розрахункові операції",
        "Блок 3. Безготівкові операції",
        "Блок 4. Розрахунки з постачальниками / виконавцями",
        "Блок 5. Розрахунки з покупцями / замовниками",
        "Блок 6. Складський облік",
        "Блок 7. Виробництво продукції та послуг",
        "Блок 8. Зарплата та кадри",
        "Блок 9. Облік необоротних та матеріальних активів",
        "Блок 10. ПДВ",
        "Блок 11. Звітність (в т. ч. фінансова)",
      ],
      makeStyles: {
        toolbar1: {
            backgroundColor: "#fff8e7", // ванільний
            color: "#3e2c23", // насичена кава
        },
        toolbar2: {
          backgroundColor: "#fffefa", // майже білий з теплим відтінком
          color: "#5c4033",
          height: "150px",
          marginBottom: "7px",
        },
        button1: {
          width: "100%",
          backgroundColor: "#d6a87a", // пісочний/карамельний
          color: "white",
          "&:hover": { backgroundColor: "#b97c50" }, // трохи темніший
        },
        button2: {
          width: "100%",
          backgroundColor: "#fae8d1", // кремовий
          color: "#5c4033",
          height: "45px",
          "&:hover": { backgroundColor: "#f1d8be" },
        },
        typography: {
          fontSize: "17px",
          fontWeight: 600,
          color: "#3f2e1f", // темний елегантний текст
        },
        discountText: {
          color: "#8b5e3c", // колір "кави з молоком"
          fontWeight: 500,
        },
        proviso: {
          fontSize: "14px",
          color: "#9e9483", // м’який сіробежевий
        },
      },
    },
  },
  {
    course: {
      classPrefix: "card14",
      title: "Курс (очно)",
      name: "«BAS кадри (з оновленим військовим обліком)»",
      start: "На вибір",
      group: "з другом -20%",
      indiv: "6300 грн",
      hours: "20 академічних годин",
      discount: "Знижка 7%",
      teacher: "Викладач: Лоік Інна Володимирівна",
      proviso3: "*Знижка 7% - за довідкою ВПО",
      program: "Програма навчання",
      order: "Записатись",
      courseProgram: ["Індивідуальна програма для кожного учня"],
      makeStyles: {
        toolbar1: {
            backgroundColor: "#fff8e7", // ванільний
            color: "#3e2c23", // насичена кава
        },
        toolbar2: {
          backgroundColor: "#fffefa", // майже білий з теплим відтінком
          color: "#5c4033",
          height: "150px",
          marginBottom: "7px",
        },
        button1: {
          width: "100%",
          backgroundColor: "#d6a87a", // пісочний/карамельний
          color: "white",
          "&:hover": { backgroundColor: "#b97c50" }, // трохи темніший
        },
        button2: {
          width: "100%",
          backgroundColor: "#fae8d1", // кремовий
          color: "#5c4033",
          height: "45px",
          "&:hover": { backgroundColor: "#f1d8be" },
        },
        typography: {
          fontSize: "17px",
          fontWeight: 600,
          color: "#3f2e1f", // темний елегантний текст
        },
        discountText: {
          color: "#8b5e3c", // колір "кави з молоком"
          fontWeight: 500,
        },
        proviso: {
          fontSize: "14px",
          color: "#9e9483", // м’який сіробежевий
        },
      },
    },
  },
  {
    course: {
      classPrefix: "card15",
      title: "Курс (очно)",
      name: "«M.E.Doc »",
      start: "Уточнюйте дату старту",
      group: "3410 грн",
      indiv: "5390 грн",
      hours: "10 ак. годин",
      discount: "Знижка 7%",
      teacher: "Викладач: Лоік Інна Володимирівна",
      proviso3: "*Знижка 7% - за довідкою ВПО",
      program: "Програма навчання",
      order: "Записатись",
      courseProgram: [
        "1) Технічне налаштування",
        "2) Робота з КЕП (ЕЦП) та захищеними носіями особистих ключів",
        "3) Подання звітів та декларацій",
        "4) Обмін електронними документами",
        "5) Облік ПДВ та акцизного податку",
        "6) Нарахування зарплати",
        "7) Подання фінансової звітності за НП(С)БО / МП(С)БО",
      ],
      makeStyles: {
        toolbar1: {
            backgroundColor: "#fff8e7", // ванільний
            color: "#3e2c23", // насичена кава
        },
        toolbar2: {
          backgroundColor: "#fffefa", // майже білий з теплим відтінком
          color: "#5c4033",
          height: "150px",
          marginBottom: "7px",
        },
        button1: {
          width: "100%",
          backgroundColor: "#d6a87a", // пісочний/карамельний
          color: "white",
          "&:hover": { backgroundColor: "#b97c50" }, // трохи темніший
        },
        button2: {
          width: "100%",
          backgroundColor: "#fae8d1", // кремовий
          color: "#5c4033",
          height: "45px",
          "&:hover": { backgroundColor: "#f1d8be" },
        },
        typography: {
          fontSize: "17px",
          fontWeight: 600,
          color: "#3f2e1f", // темний елегантний текст
        },
        discountText: {
          color: "#8b5e3c", // колір "кави з молоком"
          fontWeight: 500,
        },
        proviso: {
          fontSize: "14px",
          color: "#9e9483", // м’який сіробежевий
        },
      },
    },
  },
  {
    course: {
      classPrefix: "card16",
      title: "Курс (очно)",
      name: "«Підвищення кваліфікації бухгалтера. Блок 1: Запаси»",
      start: "На вибір",
      group: "з другом -20%",
      indiv: "договірна",
      hours: "14 академічних годин",
      discount: "Знижка 7%",
      teacher: "Викладач: Григорєва Людмила",
      proviso1: "*Знижка 7% - за довідкою ВПО",
      program: "Програма навчання",
      order: "Записатись",
      courseProgram: [
        "1) Оцінка запасів",
        "2) Види вартості",
        '3) Поняття "Переоцінка запасів"',
        "4) Дооцінка",
        "5) Чиста вартість реалізації",
        "6) Уцінка",
        "7) Документування запасів",
        "8) Списання ПММ",
        "9) Відповідальне зберігання запасів",
        "10) Відшкодування збитків покупцю",
        "11) Товарний кредит",
      ],
      makeStyles: {
        toolbar1: {
            backgroundColor: "#fff8e7", // ванільний
            color: "#3e2c23", // насичена кава
        },
        toolbar2: {
          backgroundColor: "#fffefa", // майже білий з теплим відтінком
          color: "#5c4033",
          height: "150px",
          marginBottom: "7px",
        },
        button1: {
          width: "100%",
          backgroundColor: "#d6a87a", // пісочний/карамельний
          color: "white",
          "&:hover": { backgroundColor: "#b97c50" }, // трохи темніший
        },
        button2: {
          width: "100%",
          backgroundColor: "#fae8d1", // кремовий
          color: "#5c4033",
          height: "45px",
          "&:hover": { backgroundColor: "#f1d8be" },
        },
        typography: {
          fontSize: "17px",
          fontWeight: 600,
          color: "#3f2e1f", // темний елегантний текст
        },
        discountText: {
          color: "#8b5e3c", // колір "кави з молоком"
          fontWeight: 500,
        },
        proviso: {
          fontSize: "14px",
          color: "#9e9483", // м’який сіробежевий
        },
      },
    },
  },
  {
    course: {
      classPrefix: "card17",
      title: "Курс (очно)",
      name: "«Підвищення кваліфікації бухгалтера. Блок 2: Вибуття основних засобів. Ремонт та покращення»",
      start: "На вибір",
      group: "з другом -20%",
      indiv: "договірна",
      hours: "18 академічних годин",
      discount: "Знижка 7%",
      teacher: "Викладач: Григорєва Людмила",
      proviso1: "*Знижка 7% - за довідкою ВПО",
      program: "Програма навчання",
      order: "Записатись",
      courseProgram: [
        "1) Поняття вибуття ОЗ",
        "2) Умови списання бухоблік",
        "3) Чиста вартість реалізації ОЗ",
        "4) Продаж об єкта ОЗ, який було отримано безкоштовно",
        "5) Продаж переоцінених ОЗ",
        "6) Визнання доходу від реалізації ОЗ",
        "7) Податковий облік вибуття",
        "8) Залишкова вартість ОЗ",
        "9) Не виробничо-продажна різниця",
        "10) Продаж ОЗ за інвалюту",
        "11) Ліквідаційні заходи в БО та в ПО з ОЗ без його продажу у разі непридатності",
        "12) Списання об єктів ОЗ у БО та в ПО",
        "13) ПДВ при списанні",
        "14) Безоплатна передача ОЗ",
        "15) Внесення об єкта ОЗ до статутного капіталу іншої юрособи",
        "16) Поточний ремонт об єктів ОЗ",
        "17) Ремонт та покращення ОЗ",
        "18) Приклади обліку",
      ],
      makeStyles: {
        toolbar1: {
            backgroundColor: "#fff8e7", // ванільний
            color: "#3e2c23", // насичена кава
        },
        toolbar2: {
          backgroundColor: "#fffefa", // майже білий з теплим відтінком
          color: "#5c4033",
          height: "150px",
          marginBottom: "7px",
        },
        button1: {
          width: "100%",
          backgroundColor: "#d6a87a", // пісочний/карамельний
          color: "white",
          "&:hover": { backgroundColor: "#b97c50" }, // трохи темніший
        },
        button2: {
          width: "100%",
          backgroundColor: "#fae8d1", // кремовий
          color: "#5c4033",
          height: "45px",
          "&:hover": { backgroundColor: "#f1d8be" },
        },
        typography: {
          fontSize: "17px",
          fontWeight: 600,
          color: "#3f2e1f", // темний елегантний текст
        },
        discountText: {
          color: "#8b5e3c", // колір "кави з молоком"
          fontWeight: 500,
        },
        proviso: {
          fontSize: "14px",
          color: "#9e9483", // м’який сіробежевий
        },
      },
    },
  },
  {
    course: {
      classPrefix: "card18",
      title: "Курс (очно)",
      name: "«Підвищення кваліфікації бухгалтера. Блок 3: Відокремлений підрозділ»",
      start: "На вибір",
      group: "з другом -20%",
      indiv: "договірна",
      hours: "10 академічних годин",
      discount: "Знижка 7%",
      teacher: "Викладач: Григорєва Людмила",
      proviso1: "*Знижка 7% - за довідкою ВПО",
      program: "Програма навчання",
      order: "Записатись",
      courseProgram: [
        '1) Поняття "відокремлений" або "структурний" підрозділ',
        "2) Філія, представництво та інші підрозділи",
        "3) Загальні ознаки підрозділів",
        "4) Основні ознаки відокремлених та структурних підрозділів",
        "5) Функції, права та обов язки підрозділів",
        "6) Наявність банківського рахунку та довіреності у керівника",
        "7) Майнова відокремленість",
        "8) Статус платника податків",
        "9) Порядок створення відокремленого підрозділу",
        "10) Етапи розробки та затвердження Положення про відокремлений підрозділ",
        "11) Призначення керівника та видача йому довіреності",
        "12) Облік підрозділу у податковій",
        "13) Зарплата в відокремленому підрозділі та її оподаткування (податковий агент)",
        "14) Податок на прибуток",
        "15) Відокремлений підрозділ та ПДВ",
        "16) Відокремлений підрозділ та трудові відносини",
        "17) Ліквідація відокремленого підрозділу",
      ],
      makeStyles: {
        toolbar1: {
            backgroundColor: "#fff8e7", // ванільний
            color: "#3e2c23", // насичена кава
        },
        toolbar2: {
          backgroundColor: "#fffefa", // майже білий з теплим відтінком
          color: "#5c4033",
          height: "150px",
          marginBottom: "7px",
        },
        button1: {
          width: "100%",
          backgroundColor: "#d6a87a", // пісочний/карамельний
          color: "white",
          "&:hover": { backgroundColor: "#b97c50" }, // трохи темніший
        },
        button2: {
          width: "100%",
          backgroundColor: "#fae8d1", // кремовий
          color: "#5c4033",
          height: "45px",
          "&:hover": { backgroundColor: "#f1d8be" },
        },
        typography: {
          fontSize: "17px",
          fontWeight: 600,
          color: "#3f2e1f", // темний елегантний текст
        },
        discountText: {
          color: "#8b5e3c", // колір "кави з молоком"
          fontWeight: 500,
        },
        proviso: {
          fontSize: "14px",
          color: "#9e9483", // м’який сіробежевий
        },
      },
    },
  },
  {
    course: {
      classPrefix: "card19",
      title: "Курс (очно)",
      name: "«Підвищення кваліфікації бухгалтера. Блок 4: Канцтовари»",
      start: "На вибір",
      group: "з другом -20%",
      indiv: "договірна",
      hours: "7 академічних годин",
      discount: "Знижка 7%",
      teacher: "Викладач: Григорєва Людмила",
      proviso3: "*Знижка 7% - за довідкою ВПО",
      program: "Програма навчання",
      order: "Записатись",
      courseProgram: [
        "1) Придбання канцтоварів",
        "2) Способи обліку ",
        "3) Облікова політика",
        "4) Класифікація канцтоварів:",
        "- у складі виробничих запасів;",
        "- у складі МБП;",
        "- у складі МНМА;",
        "5) Видача та документальне оформлення",
        "6) Виробниче та невиробниче використання канцтоварів",
        "7) Списання та формування фін результату",
        "8) Оподаткування:",
        "- податок на прибуток;",
        "- ПДВ;",
        "- ПДФО і ВЗ;",
      ],
      makeStyles: {
        toolbar1: {
            backgroundColor: "#fff8e7", // ванільний
            color: "#3e2c23", // насичена кава
        },
        toolbar2: {
          backgroundColor: "#fffefa", // майже білий з теплим відтінком
          color: "#5c4033",
          height: "150px",
          marginBottom: "7px",
        },
        button1: {
          width: "100%",
          backgroundColor: "#d6a87a", // пісочний/карамельний
          color: "white",
          "&:hover": { backgroundColor: "#b97c50" }, // трохи темніший
        },
        button2: {
          width: "100%",
          backgroundColor: "#fae8d1", // кремовий
          color: "#5c4033",
          height: "45px",
          "&:hover": { backgroundColor: "#f1d8be" },
        },
        typography: {
          fontSize: "17px",
          fontWeight: 600,
          color: "#3f2e1f", // темний елегантний текст
        },
        discountText: {
          color: "#8b5e3c", // колір "кави з молоком"
          fontWeight: 500,
        },
        proviso: {
          fontSize: "14px",
          color: "#9e9483", // м’який сіробежевий
        },
      },
    },
  },
];

const Schedule1 = () => {
  const classes = useStyles();

  return (
    <div className="schedule" id="schedule">
      <Container maxWidth="lg" className={classes.container}>
        <Grid
          container
          direction="row"
          alignItems="center"
          spacing={3}
          className={classes.grid}
        >
          <Grid item>
            <ScheduleItem courses={courses} course={courses[0].course} />
          </Grid>
          <Grid item>
            <ScheduleItem courses={courses} course={courses[1].course} />
          </Grid>
          <Grid item>
            <ScheduleItem courses={courses} course={courses[2].course} />
          </Grid>
          <Grid item>
            <ScheduleItem courses={courses} course={courses[3].course} />
          </Grid>
        </Grid>
      </Container>
    </div>
  );
};

const Schedule2 = () => {
  const classes = useStyles();

  return (
    <div className="schedule">
      <Container maxWidth="lg" className={classes.container}>
        <Grid
          container
          direction="row"
          alignItems="center"
          spacing={3}
          className={classes.grid}
        >
          <Grid item>
            <ScheduleItem courses={courses} course={courses[4].course} />
          </Grid>
          <Grid item>
            <ScheduleItem courses={courses} course={courses[5].course} />
          </Grid>
          <Grid item>
            <ScheduleItem courses={courses} course={courses[6].course} />
          </Grid>
          <Grid item>
            <ScheduleItem courses={courses} course={courses[7].course} />
          </Grid>
        </Grid>
      </Container>
    </div>
  );
};

const Schedule3 = () => {
  const classes = useStyles();

  return (
    <div className="schedule">
      <Container maxWidth="lg" className={classes.container}>
        <Grid
          container
          direction="row"
          alignItems="center"
          spacing={3}
          className={classes.grid}
        >
          <Grid item>
            <ScheduleItem courses={courses} course={courses[8].course} />
          </Grid>
          <Grid item>
            <ScheduleItem courses={courses} course={courses[9].course} />
          </Grid>
          <Grid item>
            <ScheduleItem courses={courses} course={courses[10].course} />
          </Grid>
          <Grid item>
            <ScheduleItem courses={courses} course={courses[11].course} />
          </Grid>
        </Grid>
      </Container>
    </div>
  );
};

const Schedule4 = () => {
  const classes = useStyles();

  return (
    <div className="schedule">
      <Container maxWidth="lg" className={classes.container}>
        <Grid
          container
          direction="row"
          alignItems="center"
          spacing={3}
          className={classes.grid}
        >
          <Grid item>
            <ScheduleItem courses={courses} course={courses[12].course} />
          </Grid>
          <Grid item>
            <ScheduleItem courses={courses} course={courses[13].course} />
          </Grid>
          <Grid item>
            <ScheduleItem courses={courses} course={courses[14].course} />
          </Grid>
          <Grid item>
            <ScheduleItem courses={courses} course={courses[15].course} />
          </Grid>
        </Grid>
      </Container>
    </div>
  );
};

const Schedule5 = () => {
  const classes = useStyles();

  return (
    <div className="schedule">
      <Container maxWidth="lg" className={classes.container}>
        <Grid
          container
          direction="row"
          alignItems="center"
          spacing={3}
          className={classes.grid}
        >
          <Grid item>
            <ScheduleItem courses={courses} course={courses[16].course} />
          </Grid>
          <Grid item>
            <ScheduleItem courses={courses} course={courses[17].course} />
          </Grid>
          <Grid item>
            <ScheduleItem courses={courses} course={courses[18].course} />
          </Grid>
        </Grid>
      </Container>
    </div>
  );
};

export { Schedule1, Schedule2, Schedule3, Schedule4, Schedule5 };
